# accounts

## import

In [1]:
#1
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

## Read Data

In [2]:
acconuts = pd.read_csv('accounts.csv')

In [3]:
acconuts.head()

   count  min_balance  max_balance country business_type  model bank_id
0  20000        50000       100000      US             I      1    bank
1  20000        50000       100000      US             I      2    bank
2  20000        50000       100000      US             I      3    bank
3  20000        50000       100000      US             I      4    bank
4  20000        50000       100000      US             I      5    bank

In [4]:
acconuts.tail()

   count  min_balance  max_balance country business_type  model bank_id
0  20000        50000       100000      US             I      1    bank
1  20000        50000       100000      US             I      2    bank
2  20000        50000       100000      US             I      3    bank
3  20000        50000       100000      US             I      4    bank
4  20000        50000       100000      US             I      5    bank

In [5]:
acconuts.shape

(5, 7)

In [6]:
acconuts.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   count          5 non-null      int64
 1   min_balance    5 non-null      int64
 2   max_balance    5 non-null      int64
 3   country        5 non-null      object
 4   business_type  5 non-null      object
 5   model          5 non-null      int64
 6   bank_id        5 non-null      object
dtypes: int64(4), object(3)
memory usage: 408.0+ bytes

## the end